import pandas as pd
file_path = "/home/yuvalyh@mta.ac.il/biobank/ukb672220.csv"

df = pd.read_csv(file_path, nrows=40)
#print(df.iloc[37, [0,1149]]) #להציג את השורה ה 37 עם העמודות 0 ו1149.

#print(str(df.iloc[:,738].name)) #לקחת את שם העמודה ה738

#print(df.iloc[37, [0,1149]][1]) #הצגת הערך שמתחת לעמודה באינדקס זה.
# למשל עבור 
#eid         1000386
#2814-1.0        NaN
# אז [1] יציג NAN 
#[0] יציג את התז

print(str(df.iloc[:,11460].name))

#41270 - 673316 מ1102 עד 1361
#41270 - 672220 מ13619 עד 13877
#31- 672220 #עמודה אחת 22
#40008- 673316 מ753 עד #775
#40008- 672220 #מ12442 עד 12464
#40006- 673316 מ731 עד #753
#40006- 672220 #מ12418 עד 12440
#26424 - 672220 #עמודה אחת 11474

#40007- חסר ב673316
#40007- 672220 # מ12440 עד 12441
#26410- חסר ב673316
#26410- 672220 # עמודה אחת 11460
